In [27]:
import pandas as pd
from sklearn import tree
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score

In [15]:
dataframe = pd.read_csv("D:\DataSetfor MLandDL\salaries.csv")

In [16]:
dataframe

       company                  job     degree  salary_more_then_100k
0       google      sales executive  bachelors                      0
1       google      sales executive    masters                      0
2       google     business manager  bachelors                      1
3       google     business manager    masters                      1
4       google  computer programmer  bachelors                      0
5       google  computer programmer    masters                      1
6   abc pharma      sales executive    masters                      0
7   abc pharma  computer programmer  bachelors                      0
8   abc pharma     business manager  bachelors                      0
9   abc pharma     business manager    masters                      1
10    facebook      sales executive  bachelors                      1
11    facebook      sales executive    masters                      1
12    facebook     business manager  bachelors                      1
13    facebook     business manager    masters                      1
14    facebook  computer programmer  bachelors                      1
15    facebook  computer programmer    masters                      1

In [18]:
input_N = dataframe.drop('salary_more_then_100k',axis=1)

In [19]:
input_N

       company                  job     degree
0       google      sales executive  bachelors
1       google      sales executive    masters
2       google     business manager  bachelors
3       google     business manager    masters
4       google  computer programmer  bachelors
5       google  computer programmer    masters
6   abc pharma      sales executive    masters
7   abc pharma  computer programmer  bachelors
8   abc pharma     business manager  bachelors
9   abc pharma     business manager    masters
10    facebook      sales executive  bachelors
11    facebook      sales executive    masters
12    facebook     business manager  bachelors
13    facebook     business manager    masters
14    facebook  computer programmer  bachelors
15    facebook  computer programmer    masters

In [20]:
target = dataframe['salary_more_then_100k']

In [21]:
target

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

# ML don,t understand categorical feature so convert into numerical feature

In [23]:
le_comp = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [24]:
input_N['company'] = le_comp.fit_transform(input_N['company'])
input_N['job'] = le_comp.fit_transform(input_N['job'])
input_N['degree'] = le_comp.fit_transform(input_N['degree'])

In [25]:
input_N

    company  job  degree
0         2    2       0
1         2    2       1
2         2    0       0
3         2    0       1
4         2    1       0
5         2    1       1
6         0    2       1
7         0    1       0
8         0    0       0
9         0    0       1
10        1    2       0
11        1    2       1
12        1    0       0
13        1    0       1
14        1    1       0
15        1    1       1

In [30]:
 
x_train, x_test, y_train, y_test  = train_test_split(input_N, target , test_size=0.2, random_state=123)

In [33]:
x_test

    company  job  degree
7         0    1       0
10        1    2       0
4         2    1       0
0         2    2       0

In [34]:
model = tree.DecisionTreeClassifier()

In [36]:
model.fit(x_train,y_train)

DecisionTreeClassifier()

In [38]:
y_train

5     1
9     1
8     0
11    1
3     1
1     0
6     0
15    1
12    1
2     1
13    1
14    1
Name: salary_more_then_100k, dtype: int64

In [37]:
# cheecking accuracy on training dataset
x_train_prd = model.predict(x_train)

In [39]:
x_train_prd

array([1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 1, 1], dtype=int64)

In [40]:
# training dataset accuracy
training_dataset_accuracy = accuracy_score(x_train_prd, y_train)

In [41]:
training_dataset_accuracy

1.0

###### checking dataset on accuracy

In [42]:
x_test_pred = model.predict(x_test)

In [43]:
x_test_pred

array([0, 1, 1, 0], dtype=int64)

In [44]:
test_dataset_accuracy = accuracy_score(x_test_pred, y_test)

In [45]:
test_dataset_accuracy

0.75